// *++
//
// Copyright (c) 2004 - 2015, Intel Corporation. All rights reserved.<BR>
// This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   SetupBrowserStr.uni
//
// Abstract:
//
//   String definitions for Browser.
//
// --*/


/=#

#langdef en-US "English"
#langdef fr-FR "Français"
#langdef zh-Hans "\wide中文\narrow"

#string UNKNOWN_STRING                 #language en-US  "!"
                                       #language fr-FR  "!"
                                       #language zh-Hans "!"
#string STATUS_BROWSER_ERROR           #language en-US  "Browser met some error, return!"
                                       #language fr-FR  "Browser met some error, return!"
                                       #language zh-Hans "Browser met some error, return!"
#string STATUS_BROWSER_FORM_NOT_FOUND  #language en-US  "Form not found, return!"
                                       #language fr-FR  "Form not found, return!"
                                       #language zh-Hans  "Form not found, return!"                                        
#string STATUS_BROWSER_NO_SUBMIT_IF    #language en-US  "Not allowed to submit, return!"
                                       #language fr-FR  "Not allowed to submit, return!"
                                       #language zh-Hans "Not allowed to submit, return!" 
#string FUNCTION_NINE_STRING           #language en-US  "F9=Reset to Defaults"
                                       #language fr-FR  "F9=Reset à Défauts"
                                       #language zh-Hans  "F9=Reset to Defaults"
#string FUNCTION_TEN_STRING            #language en-US  "F10=Save"
                                       #language fr-FR  "F10=Économiser"
                                       #language zh-Hans "F10=Save" 
#string SAVE_FAILED                    #language en-US  "Failed to Save"
                                       #language fr-FR  "Échouer à économiser"
                                       #language zh-Hans  "Failed to Save"
#string NO_SUBMIT_IF_CHECK_FAILED      #language en-US  "NO_SUBMIT_IF check fail."
                                       #language fr-FR  "NO_SUBMIT_IF check fail."
                                       #language zh-Hans  "NO_SUBMIT_IF check fail."
#string ADJUST_HELP_PAGE_DOWN          #language en-US  "More (D/d)"
                                       #language fr-FR  "More (D/d)"
                                       #language zh-Hans  "More (D/d)"
#string ADJUST_HELP_PAGE_UP            #language en-US  "More (U/u)"
                                       #language fr-FR  "More (U/u)"
                                       #language zh-Hans  "More (U/u)"
#string PROMPT_FOR_PASSWORD            #language en-US  "Please type in your password"
                                       #language fr-FR  "S'il vous plaît tape votre mot de passe"
                                       #language zh-Hans  "\wide请输入密码\narrow"                                       
#string PROMPT_FOR_NEW_PASSWORD        #language en-US  "Please type in your new password"
                                       #language fr-FR  "S'il vous plaît tape votre nouveau mot de passe"
                                       #language zh-Hans  "\wide请输入新密码\narrow"
#string CONFIRM_PASSWORD               #language en-US  "Please confirm your new password"
                                       #language fr-FR  "S'il vous plaît confirmer votre nouveau mot de passe"
                                       #language zh-Hans  "\wide确认新密码\narrow "
#string CONFIRM_ERROR                  #language en-US  "Passwords are not the same"
                                       #language fr-FR  "Les mots de passe ne sont pas pareils"
                                       #language zh-Hans  "\wide密码不同\narrow"
#string PASSWORD_INVALID               #language en-US  "Incorrect password"
                                       #language fr-FR  "Mauvais mot de passe"
                                       #language zh-Hans  "\wide密码检查失败\narrow"
#string PRESS_ENTER                    #language en-US  "Press ENTER to continue"
                                       #language fr-FR  "La presse ENTRE continuer"
                                       #language zh-Hans  "\wide按\narrow[Enter]\wide键继续\narrow"
#string PROMPT_FOR_DATA                #language en-US  "Please type in your data"
                                       #language fr-FR  "S'il vous plaît tape vos données"
                                       #language zh-Hans  "Please type in your data"
#string EMPTY_STRING                   #language en-US  ""
                                       #language fr-FR  ""
                                       #language zh-Hans "" 
#string MINI_STRING                    #language en-US  "Please enter enough characters"
                                       #language fr-FR  "Veuillez écrire assez de caractères"
                                       #language zh-Hans  "Please enter enough characters"
#string OPTION_MISMATCH                #language en-US  "Question value mismatch with Option value!"
                                       #language fr-FR  "Question valeur décalage avec l'option valeur!"
                                       #language zh-Hans  "Question value mismatch with Option value!"
#string FORM_SUPPRESSED                #language en-US  "Form is suppressed. Nothing is displayed."
                                       #language fr-FR  "Form is suppressed. Nothing is displayed."
                                       #language zh-Hans  "Form is suppressed. Nothing is displayed."
#string PROTOCOL_NOT_FOUND             #language en-US  "Convert string to device path fail. Can't goto the destination."
                                       #language fr-FR  "Convert string to device path fail. Can't goto the destination."
                                       #language zh-Hans  "Convert string to device path fail. Can't goto the destination."
#string DISCARD_OR_JUMP                #language en-US  "Press D(d) to discard changes for this form, Press G(g) to go to this form"
                                       #language fr-FR  "Press D(d) to discard changes for this form, Press G(g) to go to this form"
                                       #language zh-Hans  "Press D(d) to discard changes for this form, Press G(g) to go to this form"
#string DISCARD_OR_JUMP_DISCARD        #language en-US  "D (d)"
                                       #language fr-FR  "D (d)"
                                       #language zh-Hans "D (d)" 
#string DISCARD_OR_JUMP_JUMP           #language en-US  "G (g)"
                                       #language fr-FR  "G (g)"
                                       #language zh-Hans  "G (g)"
#string DISCARD_OR_CHECK               #language en-US  "Press D(d) to discard changes for this form, Press C(c) to check the error"
                                       #language fr-FR  "Press D(d) to discard changes for this form, Press C(c) to check the error"
                                       #language zh-Hans  "Press D(d) to discard changes for this form, Press C(c) to check the error"
#string DISCARD_OR_CHECK_CHECK         #language en-US  "C (c)"
                                       #language fr-FR  "C (c)"
                                       #language zh-Hans  "C (c)"
#string CONFIRM_DISCARD_MESSAGE        #language en-US  "Discard configuration changes"
                                       #language fr-FR  "Discard configuration changes"
                                       #language zh-Hans  "Discard configuration changes"
#string CONFIRM_DEFAULT_MESSAGE        #language en-US  "Load default configuration"
                                       #language fr-FR  "Load default configuration"
                                       #language zh-Hans  "\wide加载默认值\narrow"  
#string CONFIRM_DEFAULT_MESSAGE_2ND    #language en-US  "load default configuration"
                                       #language fr-FR  "load default configuration"
                                       #language zh-Hans "\wide加载默认值\narrow"  
#string CONFIRM_SUBMIT_MESSAGE         #language en-US  "Save configuration changes"
                                       #language fr-FR  "Save configuration changes"
                                       #language zh-Hans  "\wide保存\narrow" 

#string CONFIRM_ESC_EXIT_MESSAGE       #language en-US  "Configuration exit ?"
                                       #language fr-FR  "Configuration exit ?"
                                       #language zh-Hans "\wide确认退出\narrow?" 

#string CONFIRM_SUBMIT_MESSAGE_2ND     #language en-US  "save configuration changes"
                                       #language fr-FR  "save configuration changes"
                                       #language zh-Hans  "save configuration changes"
#string CONFIRM_RESET_MESSAGE          #language en-US  "Reset"
                                       #language fr-FR  "Reset"
                                       #language zh-Hans  "Reset"
#string CONFIRM_RESET_MESSAGE_2ND      #language en-US  "reset"
                                       #language fr-FR  "reset"
                                       #language zh-Hans "reset" 
#string CONFIRM_EXIT_MESSAGE           #language en-US  "Exit"
                                       #language fr-FR  "Exit"
                                       #language zh-Hans  "\wide退出\narrow"
#string CONFIRM_EXIT_MESSAGE_2ND       #language en-US  "exit"
                                       #language fr-FR  "exit"
                                       #language zh-Hans  "\wide退出\narrow"
#string CONFIRM_OPTION                 #language en-US   "Press 'Y' to confirm, 'N' to ignore."
                                       #language fr-FR  "Press 'Y' to confirm, 'N' to ignore."
                                       #language zh-Hans  "'Y'\wide确认，\narrow'N'\wide取消\narrow."
                                       
#string CONFIRM_OPTION_YES             #language en-US  "Y (y)"
                                       #language fr-FR  "Y (y)"
                                       #language zh-Hans  "Y (y)"
#string CONFIRM_OPTION_NO              #language en-US  "N (n)"
                                       #language fr-FR  "N (n)"
                                       #language zh-Hans  "N (n)"
#string CONFIRM_OPTION_CONNECT         #language en-US  " and "
                                       #language fr-FR  " and "
                                       #language zh-Hans  "\wide并且\narrow"
#string CONFIRM_OPTION_END             #language en-US  "?"
                                       #language fr-FR  "?"
                                       #language zh-Hans "?"                                         
